koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.h
/*
 * Copyright (C) 2019-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: USART Driver Definitions for STMicroelectronics STM32F7xx
 */

#ifndef USART_STM32F7XX_H_
#define USART_STM32F7XX_H_

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include <asm/stm32f7xx.h>
#include <Driver/RCC_STM32F7xx.h>
#include <Driver/GPIO_STM32F7xx.h>
#include <Driver/DMA_STM32F7xx.h>

#include <Driver/Driver_USART.h>

#include <device_config.h>

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

/* USART1 configuration definitions */
#if defined(DEV_USART1) && (DEV_USART1 == 1)
  #define USE_USART1

  #if !defined(USART1)
    #error "USART1 not available for selected device!"
    #undef USE_USART1
  #endif

  #if (DEV_USART1_RX_DMA == 1)
    #define USART1_RX_DMA_Stream      DMAx_STREAMy(DEV_USART1_RX_DMA_NUMBER, DEV_USART1_RX_DMA_STREAM)
    #define USART1_RX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_USART1_RX_DMA_NUMBER, DEV_USART1_RX_DMA_STREAM)
    #define USART1_RX_DMA_Channel     DMA_CHANNEL_x(DEV_USART1_RX_DMA_CHANNEL)
    #define USART1_RX_DMA_Priority    DMA_PRIORITY(DEV_USART1_RX_DMA_PRIORITY)
  #endif
  #if (DEV_USART1_TX_DMA == 1)
    #define USART1_TX_DMA_Stream      DMAx_STREAMy(DEV_USART1_TX_DMA_NUMBER, DEV_USART1_TX_DMA_STREAM)
    #define USART1_TX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_USART1_TX_DMA_NUMBER, DEV_USART1_TX_DMA_STREAM)
    #define USART1_TX_DMA_Channel     DMA_CHANNEL_x(DEV_USART1_TX_DMA_CHANNEL)
    #define USART1_TX_DMA_Priority    DMA_PRIORITY(DEV_USART1_TX_DMA_PRIORITY)
  #endif

  #if (DEV_USART1_TX == 1)
    #define USE_USART1_TX_Pin       1
    #define USART1_TX_GPIO_PORT     DEV_USART1_TX_PORT
    #define USART1_TX_GPIO_PIN      DEV_USART1_TX_PIN
    #define USART1_TX_GPIO_FUNC     DEV_USART1_TX_FUNC
  #endif

  #if (DEV_USART1_RX == 1)
    #define USE_USART1_RX_Pin       1
    #define USART1_RX_GPIO_PORT     DEV_USART1_RX_PORT
    #define USART1_RX_GPIO_PIN      DEV_USART1_RX_PIN
    #define USART1_RX_GPIO_FUNC     DEV_USART1_RX_FUNC
  #endif

  #if (DEV_USART1_CK == 1)
    #define USE_USART1_CK_Pin       1
    #define USART1_CK_GPIO_PORT     DEV_USART1_CK_PORT
    #define USART1_CK_GPIO_PIN      DEV_USART1_CK_PIN
    #define USART1_CK_GPIO_FUNC     DEV_USART1_CK_FUNC
  #endif

  #if (DEV_USART1_RTS == 1)
    #define USE_USART1_RTS_Pin      1
    #define USART1_RTS_GPIO_PORT    DEV_USART1_RTS_PORT
    #define USART1_RTS_GPIO_PIN     DEV_USART1_RTS_PIN
    #define USART1_RTS_GPIO_FUNC    DEV_USART1_RTS_FUNC
  #endif

  #if (DEV_USART1_CTS == 1)
    #define USE_USART1_CTS_Pin      1
    #define USART1_CTS_GPIO_PORT    DEV_USART1_CTS_PORT
    #define USART1_CTS_GPIO_PIN     DEV_USART1_CTS_PIN
    #define USART1_CTS_GPIO_FUNC    DEV_USART1_CTS_FUNC
  #endif
#endif

/* USART2 configuration definitions */
#if defined(DEV_USART2) && (DEV_USART2 == 1)
  #define USE_USART2

  #if !defined(USART2)
    #error "USART2 not available for selected device!"
    #undef USE_USART2
  #endif

  #if (DEV_USART2_RX_DMA == 1)
    #define USART2_RX_DMA_Stream      DMAx_STREAMy(DEV_USART2_RX_DMA_NUMBER, DEV_USART2_RX_DMA_STREAM)
    #define USART2_RX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_USART2_RX_DMA_NUMBER, DEV_USART2_RX_DMA_STREAM)
    #define USART2_RX_DMA_Channel     DMA_CHANNEL_x(DEV_USART2_RX_DMA_CHANNEL)
    #define USART2_RX_DMA_Priority    DMA_PRIORITY(DEV_USART2_RX_DMA_PRIORITY)
  #endif
  #if (DEV_USART2_TX_DMA == 1)
    #define USART2_TX_DMA_Stream      DMAx_STREAMy(DEV_USART2_TX_DMA_NUMBER, DEV_USART2_TX_DMA_STREAM)
    #define USART2_TX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_USART2_TX_DMA_NUMBER, DEV_USART2_TX_DMA_STREAM)
    #define USART2_TX_DMA_Channel     DMA_CHANNEL_x(DEV_USART2_TX_DMA_CHANNEL)
    #define USART2_TX_DMA_Priority    DMA_PRIORITY(DEV_USART2_TX_DMA_PRIORITY)
  #endif

  #if (DEV_USART2_TX == 1)
    #define USE_USART2_TX_Pin       1
    #define USART2_TX_GPIO_PORT     DEV_USART2_TX_PORT
    #define USART2_TX_GPIO_PIN      DEV_USART2_TX_PIN
    #define USART2_TX_GPIO_FUNC     DEV_USART2_TX_FUNC
  #endif

  #if (DEV_USART2_RX == 1)
    #define USE_USART2_RX_Pin       1
    #define USART2_RX_GPIO_PORT     DEV_USART2_RX_PORT
    #define USART2_RX_GPIO_PIN      DEV_USART2_RX_PIN
    #define USART2_RX_GPIO_FUNC     DEV_USART2_RX_FUNC
  #endif

  #if (DEV_USART2_CK == 1)
    #define USE_USART2_CK_Pin       1
    #define USART2_CK_GPIO_PORT     DEV_USART2_CK_PORT
    #define USART2_CK_GPIO_PIN      DEV_USART2_CK_PIN
    #define USART2_CK_GPIO_FUNC     DEV_USART2_CK_FUNC
  #endif

  #if (DEV_USART2_RTS == 1)
    #define USE_USART2_RTS_Pin      1
    #define USART2_RTS_GPIO_PORT    DEV_USART2_RTS_PORT
    #define USART2_RTS_GPIO_PIN     DEV_USART2_RTS_PIN
    #define USART2_RTS_GPIO_FUNC    DEV_USART2_RTS_FUNC
  #endif

  #if (DEV_USART2_CTS == 1)
    #define USE_USART2_CTS_Pin      1
    #define USART2_CTS_GPIO_PORT    DEV_USART2_CTS_PORT
    #define USART2_CTS_GPIO_PIN     DEV_USART2_CTS_PIN
    #define USART2_CTS_GPIO_FUNC    DEV_USART2_CTS_FUNC
  #endif
#endif

/* USART3 configuration definitions */
#if defined(DEV_USART3) && (DEV_USART3 == 1)
  #define USE_USART3

