koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.h
  #if (DEV_USART6_TX == 1)
    #define USE_USART6_TX_Pin         1
    #define USART6_TX_GPIO_PORT       DEV_USART6_TX_PORT
    #define USART6_TX_GPIO_PIN        DEV_USART6_TX_PIN
    #define USART6_TX_GPIO_FUNC       DEV_USART6_TX_FUNC
  #endif

  #if (DEV_USART6_RX == 1)
    #define USE_USART6_RX_Pin         1
    #define USART6_RX_GPIO_PORT       DEV_USART6_RX_PORT
    #define USART6_RX_GPIO_PIN        DEV_USART6_RX_PIN
    #define USART6_RX_GPIO_FUNC       DEV_USART6_RX_FUNC
  #endif

  #if (DEV_USART6_CK == 1)
    #define USE_USART6_CK_Pin         1
    #define USART6_CK_GPIO_PORT       DEV_USART6_CK_PORT
    #define USART6_CK_GPIO_PIN        DEV_USART6_CK_PIN
    #define USART6_CK_GPIO_FUNC       DEV_USART6_CK_FUNC
  #endif

  #if (DEV_USART6_RTS == 1)
    #define USE_USART6_RTS_Pin        1
    #define USART6_RTS_GPIO_PORT      DEV_USART6_RTS_PORT
    #define USART6_RTS_GPIO_PIN       DEV_USART6_RTS_PIN
    #define USART6_RTS_GPIO_FUNC      DEV_USART6_RTS_FUNC
  #endif

  #if (DEV_USART6_CTS == 1)
    #define USE_USART6_CTS_Pin        1
    #define USART6_CTS_GPIO_PORT      DEV_USART6_CTS_PORT
    #define USART6_CTS_GPIO_PIN       DEV_USART6_CTS_PIN
    #define USART6_CTS_GPIO_FUNC      DEV_USART6_CTS_FUNC
  #endif
#endif

/* UART7 configuration definitions */
#if defined(DEV_UART7) && (DEV_UART7 == 1)
  #define USE_UART7

  #if !defined(UART7)
    #error "UART7 not available for selected device!"
    #undef USE_UART7
  #endif

  #if (DEV_UART7_RX_DMA == 1)
    #define UART7_RX_DMA_Stream      DMAx_STREAMy(DEV_UART7_RX_DMA_NUMBER, DEV_UART7_RX_DMA_STREAM)
    #define UART7_RX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_UART7_RX_DMA_NUMBER, DEV_UART7_RX_DMA_STREAM)
    #define UART7_RX_DMA_Channel     DMA_CHANNEL_x(DEV_UART7_RX_DMA_CHANNEL)
    #define UART7_RX_DMA_Priority    DMA_PRIORITY(DEV_UART7_RX_DMA_PRIORITY)
  #endif
  #if (DEV_UART7_TX_DMA == 1)
    #define UART7_TX_DMA_Stream      DMAx_STREAMy(DEV_UART7_TX_DMA_NUMBER, DEV_UART7_TX_DMA_STREAM)
    #define UART7_TX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_UART7_TX_DMA_NUMBER, DEV_UART7_TX_DMA_STREAM)
    #define UART7_TX_DMA_Channel     DMA_CHANNEL_x(DEV_UART7_TX_DMA_CHANNEL)
    #define UART7_TX_DMA_Priority    DMA_PRIORITY(DEV_UART7_TX_DMA_PRIORITY)
  #endif

  #if (DEV_UART7_TX == 1)
    #define USE_UART7_TX_Pin         1
    #define UART7_TX_GPIO_PORT       DEV_UART7_TX_PORT
    #define UART7_TX_GPIO_PIN        DEV_UART7_TX_PIN
    #define UART7_TX_GPIO_FUNC       DEV_UART7_TX_FUNC
  #endif

  #if (DEV_UART7_RX == 1)
    #define USE_UART7_RX_Pin         1
    #define UART7_RX_GPIO_PORT       DEV_UART7_RX_PORT
    #define UART7_RX_GPIO_PIN        DEV_UART7_RX_PIN
    #define UART7_RX_GPIO_FUNC       DEV_UART7_RX_FUNC
  #endif

  #if (DEV_UART7_RTS == 1)
    #define USE_UART7_RTS_Pin        1
    #define UART7_RTS_GPIO_PORT      DEV_UART7_RTS_PORT
    #define UART7_RTS_GPIO_PIN       DEV_UART7_RTS_PIN
    #define UART7_RTS_GPIO_FUNC      DEV_UART7_RTS_FUNC
  #endif

  #if (DEV_UART7_CTS == 1)
    #define USE_UART7_CTS_Pin        1
    #define UART7_CTS_GPIO_PORT      DEV_UART7_CTS_PORT
    #define UART7_CTS_GPIO_PIN       DEV_UART7_CTS_PIN
    #define UART7_CTS_GPIO_FUNC      DEV_UART7_CTS_FUNC
  #endif
#endif

/* UART8 configuration definitions */
#if defined(DEV_UART8) && (DEV_UART8 == 1)
  #define USE_UART8

  #if !defined(UART8)
    #error "UART8 not available for selected device!"
    #undef USE_UART8
  #endif

  #if (DEV_UART8_RX_DMA == 1)
    #define UART8_RX_DMA_Stream      DMAx_STREAMy(DEV_UART8_RX_DMA_NUMBER, DEV_UART8_RX_DMA_STREAM)
    #define UART8_RX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_UART8_RX_DMA_NUMBER, DEV_UART8_RX_DMA_STREAM)
    #define UART8_RX_DMA_Channel     DMA_CHANNEL_x(DEV_UART8_RX_DMA_CHANNEL)
    #define UART8_RX_DMA_Priority    DMA_PRIORITY(DEV_UART8_RX_DMA_PRIORITY)
  #endif
  #if (DEV_UART8_TX_DMA == 1)
    #define UART8_TX_DMA_Stream      DMAx_STREAMy(DEV_UART8_TX_DMA_NUMBER, DEV_UART8_TX_DMA_STREAM)
    #define UART8_TX_DMA_IRQn        DMAx_STREAMy_IRQn(DEV_UART8_TX_DMA_NUMBER, DEV_UART8_TX_DMA_STREAM)
    #define UART8_TX_DMA_Channel     DMA_CHANNEL_x(DEV_UART8_TX_DMA_CHANNEL)
    #define UART8_TX_DMA_Priority    DMA_PRIORITY(DEV_UART8_TX_DMA_PRIORITY)
  #endif

  #if (DEV_UART8_TX == 1)
    #define USE_UART8_TX_Pin         1
    #define UART8_TX_GPIO_PORT       DEV_UART8_TX_PORT
    #define UART8_TX_GPIO_PIN        DEV_UART8_TX_PIN
    #define UART8_TX_GPIO_FUNC       DEV_UART8_TX_FUNC
  #endif

  #if (DEV_UART8_RX == 1)
    #define USE_UART8_RX_Pin         1
    #define UART8_RX_GPIO_PORT       DEV_UART8_RX_PORT
    #define UART8_RX_GPIO_PIN        DEV_UART8_RX_PIN
    #define UART8_RX_GPIO_FUNC       DEV_UART8_RX_FUNC
  #endif

  #if (DEV_UART8_RTS == 1)
    #define USE_UART8_RTS_Pin        1
    #define UART8_RTS_GPIO_PORT      DEV_UART8_RTS_PORT
    #define UART8_RTS_GPIO_PIN       DEV_UART8_RTS_PIN
    #define UART8_RTS_GPIO_FUNC      DEV_UART8_RTS_FUNC
  #endif

  #if (DEV_UART8_CTS == 1)
    #define USE_UART8_CTS_Pin        1
    #define UART8_CTS_GPIO_PORT      DEV_UART8_CTS_PORT
    #define UART8_CTS_GPIO_PIN       DEV_UART8_CTS_PIN
    #define UART8_CTS_GPIO_FUNC      DEV_UART8_CTS_FUNC
  #endif
#endif

#if (defined(USART1_RX_DMA_Stream) || \
     defined(USART2_RX_DMA_Stream) || \
     defined(USART3_RX_DMA_Stream) || \
     defined( UART4_RX_DMA_Stream) || \
     defined( UART5_RX_DMA_Stream) || \
     defined(USART6_RX_DMA_Stream) || \
     defined( UART7_TX_DMA_Stream) || \
     defined( UART8_TX_DMA_Stream))
#define __USART_DMA_RX
#endif
#if (defined(USART1_TX_DMA_Stream) || \
     defined(USART2_TX_DMA_Stream) || \
     defined(USART3_TX_DMA_Stream) || \
     defined( UART4_TX_DMA_Stream) || \
     defined( UART5_TX_DMA_Stream) || \
     defined(USART6_RX_DMA_Stream) || \
     defined( UART7_TX_DMA_Stream) || \
     defined( UART8_TX_DMA_Stream))
#define __USART_DMA_TX
#endif
#if (defined(__USART_DMA_RX) && defined(__USART_DMA_TX))
#define __USART_DMA
#endif

#define USARTx_EXPORT_DRIVER(x)                                                                                                                                                            \
static USART_CAPABILITIES  USART##x##_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART##x##_Resources);                  } \
static int32_t                 USART##x##_Initialize      (USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART##x##_Resources);             } \
static int32_t                 USART##x##_Uninitialize    (void)                                                { return USART_Uninitialize (&USART##x##_Resources);                     } \
static int32_t                 USART##x##_PowerControl    (POWER_STATE state)                               { return USART_PowerControl (state, &USART##x##_Resources);              } \
static int32_t                 USART##x##_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART##x##_Resources);                  } \
static int32_t                 USART##x##_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART##x##_Resources);               } \
static int32_t                 USART##x##_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART##x##_Resources); } \
static uint32_t                USART##x##_GetTxCount      (void)                                                { return USART_GetTxCount (&USART##x##_Resources);                       } \
static uint32_t                USART##x##_GetRxCount      (void)                                                { return USART_GetRxCount (&USART##x##_Resources);                       } \
static int32_t                 USART##x##_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART##x##_Resources);            } \
static USART_STATUS        USART##x##_GetStatus       (void)                                                { return USART_GetStatus (&USART##x##_Resources);                        } \
static int32_t                 USART##x##_SetModemControl (USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART##x##_Resources);         } \
static USART_MODEM_STATUS  USART##x##_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART##x##_Resources);                   } \
       void                    USART##x##_IRQHandler      (void)                                                {        USART_IRQHandler (&USART##x##_Resources);                       } \
                                                                                                                                                                                           \
DRIVER_USART Driver_USART##x = {                                                                                                                                                       \
    USARTx_GetVersion,                                                                                                                                                                     \
    USART##x##_GetCapabilities,                                                                                                                                                            \
    USART##x##_Initialize,                                                                                                                                                                 \
    USART##x##_Uninitialize,                                                                                                                                                               \
    USART##x##_PowerControl,                                                                                                                                                               \
    USART##x##_Send,                                                                                                                                                                       \
    USART##x##_Receive,                                                                                                                                                                    \
    USART##x##_Transfer,                                                                                                                                                                   \
    USART##x##_GetTxCount,                                                                                                                                                                 \
    USART##x##_GetRxCount,                                                                                                                                                                 \
    USART##x##_Control,                                                                                                                                                                    \
    USART##x##_GetStatus,                                                                                                                                                                  \
    USART##x##_SetModemControl,                                                                                                                                                            \
    USART##x##_GetModemStatus                                                                                                                                                              \
};

