koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/USART_STM32F7xx.h
#define UARTx_EXPORT_DRIVER(x)                                                                                                                                                             \
static USART_CAPABILITIES  USART##x##_GetCapabilities (void)                                                { return USART_GetCapabilities (&UART##x##_Resources);                   } \
static int32_t                 USART##x##_Initialize      (USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &UART##x##_Resources);              } \
static int32_t                 USART##x##_Uninitialize    (void)                                                { return USART_Uninitialize (&UART##x##_Resources);                      } \
static int32_t                 USART##x##_PowerControl    (POWER_STATE state)                               { return USART_PowerControl (state, &UART##x##_Resources);               } \
static int32_t                 USART##x##_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &UART##x##_Resources);                   } \
static int32_t                 USART##x##_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &UART##x##_Resources);                } \
static int32_t                 USART##x##_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &UART##x##_Resources);  } \
static uint32_t                USART##x##_GetTxCount      (void)                                                { return USART_GetTxCount (&UART##x##_Resources);                        } \
static uint32_t                USART##x##_GetRxCount      (void)                                                { return USART_GetRxCount (&UART##x##_Resources);                        } \
static int32_t                 USART##x##_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &UART##x##_Resources);             } \
static USART_STATUS        USART##x##_GetStatus       (void)                                                { return USART_GetStatus (&UART##x##_Resources);                         } \
static int32_t                 USART##x##_SetModemControl (USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &UART##x##_Resources);          } \
static USART_MODEM_STATUS  USART##x##_GetModemStatus  (void)                                                { return USART_GetModemStatus (&UART##x##_Resources);                    } \
       void                    UART##x##_IRQHandler       (void)                                                {        USART_IRQHandler (&UART##x##_Resources);                        } \
                                                                                                                                                                                           \
DRIVER_USART Driver_USART##x = {                                                                                                                                                       \
    USARTx_GetVersion,                                                                                                                                                                     \
    USART##x##_GetCapabilities,                                                                                                                                                            \
    USART##x##_Initialize,                                                                                                                                                                 \
    USART##x##_Uninitialize,                                                                                                                                                               \
    USART##x##_PowerControl,                                                                                                                                                               \
    USART##x##_Send,                                                                                                                                                                       \
    USART##x##_Receive,                                                                                                                                                                    \
    USART##x##_Transfer,                                                                                                                                                                   \
    USART##x##_GetTxCount,                                                                                                                                                                 \
    USART##x##_GetRxCount,                                                                                                                                                                 \
    USART##x##_Control,                                                                                                                                                                    \
    USART##x##_GetStatus,                                                                                                                                                                  \
    USART##x##_SetModemControl,                                                                                                                                                            \
    USART##x##_GetModemStatus                                                                                                                                                              \
}

#define USART_BAUDRATE_DIVIDER(_PCLK_, _BAUD_)  (((_PCLK_) + ((_BAUD_)/2U)) / (_BAUD_))

/* USART flags */
#define USART_FLAG_INITIALIZED      ((uint8_t)(1U << 0U))
#define USART_FLAG_POWERED          ((uint8_t)(1U << 1U))
#define USART_FLAG_CONFIGURED       ((uint8_t)(1U << 2U))
#define USART_FLAG_TX_ENABLED       ((uint8_t)(1U << 3U))
#define USART_FLAG_RX_ENABLED       ((uint8_t)(1U << 4U))

